app/controllers/categories_controller.rb

  def index
    @categories = Category.all
---
SELECT `categories`.* FROM `categories`

  def create
    @category = Category.new(category_params)

    respond_to do |format|
      if @category.save
---
INSERT INTO `categories` (`kind`, `created_at`, `updated_at`) VALUES ('Monkey', '2016-06-10 03:44:24', '2016-06-10 03:44:24')

  def destroy
    @category.destroy
---
DELETE FROM `categories` WHERE `categories`.`id` = 2

    def set_category
      @category = Category.find(params[:id])
---
SELECT  `categories`.* FROM `categories` WHERE `categories`.`id` = 2 LIMIT 1