app/controllers/entries_controller.rb

SELECT  `categories`.* FROM `categories` WHERE `categories`.`id` = 2 LIMIT 1
INSERT INTO `entries` (`name`, `quantity`, `category_id`, `created_at`, `updated_at`) VALUES ('Tail', 14, 2, '2016-06-11 23:11:15', '2016-06-11 23:11:15')
---
	def create
		@category = Category.find(params[:category_id])
		@entry = @category.entries.create(entry_params)

SELECT  `categories`.* FROM `categories` WHERE `categories`.`id` = 4 LIMIT 1
SELECT  `entries`.* FROM `entries` WHERE `entries`.`category_id` = 4 AND `entries`.`id` = 10 LIMIT 1
---
	def edit
		@category = Category.find(params[:category_id])
		@entry = @category.entries.find(params[:id])

SELECT  `categories`.* FROM `categories` WHERE `categories`.`id` = 4 LIMIT 1
SELECT  `entries`.* FROM `entries` WHERE `entries`.`category_id` = 4 AND `entries`.`id` = 10 LIMIT 1
---
	def update
		@category = Category.find(params[:category_id])
		@entry = @category.entries.find(params[:id])