app/controllers/part_names_controller.rb

SELECT `part_names`.* FROM `part_names`
---
  def index
    @part_names = PartName.all

INSERT INTO `part_names` (`Name`, `part_kinds_id`, `created_at`, `updated_at`) VALUES ('fdasfdsff', 2, '2016-06-06 22:31:09', '2016-06-06 22:31:09')
---
  def create
    @part_name = PartName.new(part_name_params)

    respond_to do |format|
      if @part_name.save

SELECT  `part_names`.* FROM `part_names` WHERE `part_names`.`id` = 1 LIMIT 1
---
    def set_part_name
      @part_name = PartName.find(params[:id])