app/controllers/part_types_controller.rb

SELECT `part_types`.* FROM `part_types`
---
  def index
    @part_types = PartType.all