app/controllers/part_kinds_controller.rb

SELECT `part_kinds`.* FROM `part_kinds`
---
  def index
    @part_kinds = PartKind.all

INSERT INTO `part_kinds` (`kind`, `created_at`, `updated_at`) VALUES ('screw', '2016-06-06 02:08:59', '2016-06-06 02:08:59')
---
  def create
    @part_kind = PartKind.new(part_kind_params)

    respond_to do |format|
      if @part_kind.save

UPDATE `part_kinds` SET `kind` = 'Screw', `updated_at` = '2016-06-06 18:50:58' WHERE `part_kinds`.`id` = 1
---
  def update
    respond_to do |format|
      if @part_kind.update(part_kind_params)

DELETE FROM `part_kinds` WHERE `part_kinds`.`id` = 1
---
  def destroy
    @part_kind.destroy

SELECT  `part_kinds`.* FROM `part_kinds` WHERE `part_kinds`.`id` = 1 LIMIT 1
---
    def set_part_kind
      @part_kind = PartKind.find(params[:id])