app/views/categories/show.html.erb

SELECT `entries`.* FROM `entries` WHERE `entries`.`category_id` = 1
---
    <tbody>
    <% @category.entries.each do |entry| %>